# Venice Meteorological Data Analysis

In [10]:
import warnings
import datetime
import numpy as np
import pandas as pd
import seaborn as sns
import matplotlib.pyplot as plt
warnings.filterwarnings('once')
%matplotlib inline

## Importing Datasets
Below, we'll import and explore summaries of all the collected datasets from Venice meteorological centres.

### Astronomical Tides Data

In [6]:
#astronomical tides data 2022
astro_tide_2022 = pd.read_json('astronomical_tide_2022.json')
astro_tide_2022.rename(columns={'data':'date','valore':'value'}, inplace=True) #Translate column names from Italian
astro_tide_2022.head()

                  date  value
0  2022-01-01 00:00:00     45
1  2022-01-01 00:05:00     44
2  2022-01-01 00:10:00     43
3  2022-01-01 00:15:00     42
4  2022-01-01 00:20:00     42

In [12]:
astro_tide_2022.describe()

               value
count  105120.000000
mean       32.222108
std        24.179518
min       -34.000000
25%        15.000000
50%        34.000000
75%        50.000000
max        87.000000

In [13]:
astro_tide_2022.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 105120 entries, 0 to 105119
Data columns (total 2 columns):
 #   Column  Non-Null Count   Dtype
---  ------  --------------   -----
 0   date    105120 non-null  object
 1   value   105120 non-null  int64
dtypes: int64(1), object(1)
memory usage: 1.6+ MB

In [14]:
#astronomical tides data 2023
astro_tide_2023 = pd.read_json('astronomical_tide_2023.json')
astro_tide_2023.rename(columns={'data':'date','valore':'value'}, inplace=True) #Translate column names from Italian
astro_tide_2023.head()

                  date  value
0  2023-01-01 00:00:00     21
1  2023-01-01 00:05:00     22
2  2023-01-01 00:10:00     22
3  2023-01-01 00:15:00     22
4  2023-01-01 00:20:00     23

In [15]:
astro_tide_2023.describe()

               value
count  105120.000000
mean       32.662072
std        24.391790
min       -33.000000
25%        15.000000
50%        34.000000
75%        51.000000
max        86.000000

In [16]:
astro_tide_2023.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 105120 entries, 0 to 105119
Data columns (total 2 columns):
 #   Column  Non-Null Count   Dtype
---  ------  --------------   -----
 0   date    105120 non-null  object
 1   value   105120 non-null  int64
dtypes: int64(1), object(1)
memory usage: 1.6+ MB

### Data from Stations

In [19]:
burano_station = pd.read_csv('Stazione_Burano.csv', delimiter=';')
burano_station.head()

                  Data  Burano Liv.Idrom. medio 1m
0  2022-11-10 00:00:00                        0.66
1  2022-11-10 00:05:00                        0.67
2  2022-11-10 00:10:00                        0.67
3  2022-11-10 00:15:00                        0.67
4  2022-11-10 00:20:00                        0.67